const 돌의내구도 = [1, 2, 1, 4]

const 독 = [{
  "이름" : "루비독",
  "나이" : "95년생",
  "점프력" : "3",
  "몸무게" : "4",
  },{
  "이름" : "피치독",
  "나이" : "95년생",
  "점프력" : "3",
  "몸무게" : "3",
  },{
  "이름" : "씨-독",
  "나이" : "72년생",
  "점프력" : "2",
  "몸무게" : "1",
  },{
  "이름" : "코볼독",
  "나이" : "59년생",
  "점프력" : "1",
  "몸무게" : "1",
  },
]

const 징검다리를건너라 = (돌의내구도, 독) => {
  let result = [];
  for (let 개별독 of 독) {
    let 독의위치 = 0;
    let 실패 = false;
    while (독의위치 < 돌의내구도.length) {
      독의위치 += parseInt(개별독['점프력'], 10);
      돌의내구도[독의위치 - 1] -= parseInt(개별독['몸무게'], 10);
      if (돌의내구도[독의위치 - 1] < 0) {
        실패 = true;
        break;
      }
    }
    if (!실패) {
      result.push(개별독['이름']);
    }
  }
  return result;
}

console.log(징검다리를건너라(돌의내구도, 독))